src/cf/InformationRegisters/ВариантыПримененияТребованийЗаконодательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ВариантыПримененияТребованийЗаконодательства</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияПримененияТребованийЗаконодательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НалогиОтчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НалогиОтчеты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалогОтчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиБухгалтера</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаПредставленияОтчетовУплатыНалогов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/УсловияПримененияТребованийЗаконодательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>УсловияПримененияТребованийЗаконодательства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮридическиеЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьСотрудники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносыСотрудников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяСистемаНалогообложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпрощеннаяСистемаНалогообложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлательщикиНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлательщикиЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлательщикиТорговогоСбора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьЗемельныеУчастки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьТранспортныеСредства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьИмущество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БухгалтерскаяОтчетностьОбщаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БухгалтерскаяОтчетностьМалыеПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БухгалтерскаяОтчетностьНекоммерческиеОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БухгалтерскаяОтчетностьСоциальноОриентированные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыльАвансыЕжеквартально</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыльАвансыЕжемесячно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыльАвансыПоФактическойПрибыли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АкцизыОбщаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АкцизыОбщийСрок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АкцизыФормаАлкоголь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АкцизыФормаТабак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АкцизыЛьготныйСрок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыПоАкцизам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничнаяПродажаАлкоголя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОптоваяТорговляАлкоголем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоАлгоколя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревозкаАлкоголя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачаВыбранаПользователем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПравилоВыбраноПользователем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеСтраховыеВзносы_Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеСтраховыеВзносы_Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетностьПФРвЭлектронномВиде</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетностьПФРнаБумажномНосителе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетностьФССвЭлектронномВиде</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетностьФССнаБумажномНосителе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмпортТоваровТаможенныйСоюз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничнаяПродажаПива</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СверкаДанныхНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖурналСчетовФактур</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияНовойОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетностьНалоговогоАгентаПоНДФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыставлениеСчетовФактурНеплательщикамиНДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ВариантыПримененияТребованийЗаконодательства/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
Функция НастройкиПримененияТребований() Экспорт
	
	Настройки = Новый ТаблицаЗначений;
	Настройки.Колонки.Добавить("Наименование",    Новый ОписаниеТипов("Строка"));
	Настройки.Колонки.Добавить("Задача",          Новый ОписаниеТипов("СправочникСсылка.ЗадачиБухгалтера"));
	Настройки.Колонки.Добавить("Варианты",        Новый ОписаниеТипов("ТаблицаЗначений, ПеречислениеСсылка.УсловияПримененияТребованийЗаконодательства"));
	Настройки.Колонки.Добавить("ЗаголовокВыбора", Новый ОписаниеТипов("Строка")); // Заголовок переключателя в форме выбора
	Настройки.Колонки.Добавить("ВыбиратьВСписке", Новый ОписаниеТипов("Булево"));
	Настройки.Индексы.Добавить("Задача");
	
	Условия = Перечисления.УсловияПримененияТребованийЗаконодательства;
	
	// Дополнительные страховые взносы сотрудников
	Настройка = ДобавитьНастройку(
		Настройки,
		НСтр("ru = 'Перечисление доп. страховых взносов сотрудников'"),
		"СтраховыеВзносы",
		НСтр("ru = 'Доп. взносы сотрудников'")); // Заголовок выбора
		
	Если Настройка <> Неопределено Тогда
		Вариант = Настройка.Варианты.Добавить();
		Вариант.Условие       = Условия.ПустаяСсылка();
		Вариант.Представление = НСтр("ru = 'Не перечисляются доп. взносы сотрудников'");
		Вариант.ТекстВыбора   = НСтр("ru = 'не перечисляются'");
		
		Вариант = Настройка.Варианты.Добавить();
		Вариант.Условие       = Условия.СтраховыеВзносыСотрудников;
		Вариант.Представление = НСтр("ru = 'Перечисляются доп. взносы сотрудников'");
		Вариант.ТекстВыбора   = НСтр("ru = 'перечисляются'");
	КонецЕсли;
	
	// Алкоголь  
	МетаданныеЗначенийПеречисления = Метаданные.Перечисления.УсловияПримененияТребованийЗаконодательства.ЗначенияПеречисления;
	
	УсловияАлкоголь = Новый Массив;
	УсловияАлкоголь.Добавить(Условия.РозничнаяПродажаАлкоголя);
	УсловияАлкоголь.Добавить(Условия.РозничнаяПродажаПива);
	УсловияАлкоголь.Добавить(Условия.ОптоваяТорговляАлкоголем);
	УсловияАлкоголь.Добавить(Условия.ПроизводствоАлгоколя);
	УсловияАлкоголь.Добавить(Условия.ПеревозкаАлкоголя);
	
	Для Каждого УсловиеАлкоголь Из УсловияАлкоголь Цикл
		
		Представление = "" + УсловиеАлкоголь;
		
		Настройка = ДобавитьНастройку(Настройки,
			Представление,
			"ДекларированиеАлкогольнойПродукции",
			Представление,
			Истина,           // Выбирать в списке
			УсловиеАлкоголь); // Настройка
			
	КонецЦикла;
	
	Возврат Настройки;
	
КонецФункции

Функция ДобавитьНастройку(Настройки, Наименование, КодЗадачи, ЗаголовокВыбора, ВыбиратьВСписке = Ложь, Варианты = Неопределено)
	
	Задача = Справочники.ЗадачиБухгалтера.НайтиПоКоду(КодЗадачи);
	
	Если Задача.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НоваяСтрока = Настройки.Добавить();
	НоваяСтрока.Наименование       = Наименование;
	НоваяСтрока.Задача             = Задача;
	НоваяСтрока.ЗаголовокВыбора    = ЗаголовокВыбора;
	НоваяСтрока.ВыбиратьВСписке    = ВыбиратьВСписке;
	
	Если Варианты = Неопределено Тогда
		НоваяСтрока.Варианты = РегистрыСведений.НалогиОтчеты.НовыйВариантыДетальнойНастройки();
		НоваяСтрока.Варианты.Колонки.Добавить("Условие",       Новый ОписаниеТипов("ПеречислениеСсылка.УсловияПримененияТребованийЗаконодательства"));
	Иначе
		НоваяСтрока.Варианты = Варианты;
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
КонецФункции

Функция УсловияИзНастроек(Организация) Экспорт
	
	ПроверенныеУсловия = Новый Соответствие;
	
	// Проверим, выполняются ли варианты по умолчанию.
	// Такие варианты выполняются, если пользователь не выбрал какой-либо вытесняющий вариант.
	ВариантыПоУмолчанию = Новый ТаблицаЗначений;
	ВариантыПоУмолчанию.Колонки.Добавить("Основной",    Новый ОписаниеТипов("ПеречислениеСсылка.УсловияПримененияТребованийЗаконодательства"));
	ВариантыПоУмолчанию.Колонки.Добавить("Вытесняющий", Новый ОписаниеТипов("ПеречислениеСсылка.УсловияПримененияТребованийЗаконодательства"));
	ВариантыПоУмолчанию.Индексы.Добавить("Вытесняющий");
	
	Для Каждого НаборВариантов Из НастройкиПримененияТребований() Цикл
		
		СпособОписанияВариантов = ТипЗнч(НаборВариантов.Варианты);
		Если СпособОписанияВариантов <> Тип("ТаблицаЗначений")  Тогда
			// Значений по умолчанию нет, вытеснять нечего
			Продолжить;
		КонецЕсли;
			
		КоличествоВариантов = НаборВариантов.Варианты.Количество();
		
		Если КоличествоВариантов = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ВариантПоУмолчанию = НаборВариантов.Варианты[0].Условие;
		
		Если Не ЗначениеЗаполнено(ВариантПоУмолчанию) Тогда
			// Этот вариант для нас бесполезен - вытеснять нечего
			Продолжить;
		КонецЕсли;
		
		ПроверенныеУсловия.Вставить(ВариантПоУмолчанию, Истина);
		
		Для Индекс = 1 По НаборВариантов.Варианты.Количество()-1 Цикл // Исключаем вариант по умолчанию
			
			НоваяСтрока = ВариантыПоУмолчанию.Добавить();
			НоваяСтрока.Основной    = ВариантПоУмолчанию;
			НоваяСтрока.Вытесняющий = НаборВариантов.Варианты[Индекс].Условие;
			
			ПроверенныеУсловия.Вставить(НоваяСтрока.Вытесняющий, Ложь);
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Что выбрал пользователь в настройках списка?
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Настройки.Условие
	|ИЗ
	|	РегистрСведений.ВариантыПримененияТребованийЗаконодательства КАК Настройки
	|ГДЕ
	|	Настройки.Организация = &Организация";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// Выбранное условие "включим"
		ПроверенныеУсловия.Вставить(Выборка.Условие, Истина);
		
		// Условия, вытесненные выбранным, "выключим"
		Отбор = Новый Структура;
		Отбор.Вставить("Вытесняющий", Выборка.Условие);
		Для Каждого Вытеснение Из ВариантыПоУмолчанию.НайтиСтроки(Отбор) Цикл
			ПроверенныеУсловия.Вставить(Вытеснение.Основной, Ложь);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ПроверенныеУсловия;
	
КонецФункции

// Содержит перечень настроек, которые ранее хранились в этом регистре,
// но затем были перемещены в другие хранилища.
// 
// Возвращаемое значение:
//  ФиксированныйМассив - перечень элементов ПеречислениеСсылка.УсловияПримененияТребованийЗаконодательства
//
Функция УсловияПроверяемыеПоДругимНастройкам() Экспорт
	
	Условия = Перечисления.УсловияПримененияТребованийЗаконодательства;
	
	УсловияПроверяемыеПоДругимНастройкам = Новый Массив;
	
	// см. РегистрСведений.УчетнаяПолитика.Ресурсы.ВариантБухгалтерскойОтчетности
	УсловияПроверяемыеПоДругимНастройкам.Добавить(Условия.БухгалтерскаяОтчетностьМалыеПредприятия);
	УсловияПроверяемыеПоДругимНастройкам.Добавить(Условия.БухгалтерскаяОтчетностьНекоммерческиеОрганизации);
	УсловияПроверяемыеПоДругимНастройкам.Добавить(Условия.БухгалтерскаяОтчетностьОбщаяФорма);
	УсловияПроверяемыеПоДругимНастройкам.Добавить(Условия.БухгалтерскаяОтчетностьСоциальноОриентированные);
	
	// см. РегистрСведений.НастройкиУчетаНалогаНаПрибыль.Ресурсы.ПорядокУплатыАвансов
	УсловияПроверяемыеПоДругимНастройкам.Добавить(Условия.НалогНаПрибыльАвансыЕжеквартально);
	УсловияПроверяемыеПоДругимНастройкам.Добавить(Условия.НалогНаПрибыльАвансыЕжемесячно);
	УсловияПроверяемыеПоДругимНастройкам.Добавить(Условия.НалогНаПрибыльАвансыПоФактическойПрибыли);
	
	Возврат Новый ФиксированныйМассив(УсловияПроверяемыеПоДругимНастройкам);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиОбновления

// Некоторые настройки были перемещены из регистра
// ВариантыПримененияТребованийЗаконодательства в другие регистры.
//
Процедура УдалитьПеренесенныеНастройки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр(
		"УсловияПроверяемыеПоДругимНастройкам",
		УсловияПроверяемыеПоДругимНастройкам());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.Организация КАК Организация,
	|	Настройки.Условие КАК Условие
	|ИЗ
	|	РегистрСведений.ВариантыПримененияТребованийЗаконодательства КАК Настройки
	|ГДЕ
	|	Настройки.Условие В(&УсловияПроверяемыеПоДругимНастройкам)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Удаляем записи по одной, так как записей к удалению заведомо немного,
	// много меньше, чем записей в регистре.
	// ОбновлениеИнформационнойБазы.УдалитьДанные() не может использоваться для менеджера записи,
	// поэтому используем набор записей, состоящий из одной записи.
	НаборЗаписей = РегистрыСведений.ВариантыПримененияТребованийЗаконодательства.СоздатьНаборЗаписей();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
		НаборЗаписей.Отбор.Условие.Установить(Выборка.Условие);
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
